src/Documents/РозничнаяПродажа/РозничнаяПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e38925fb-25d2-4ecc-a58b-3d32346b67b4">
  <name>РозничнаяПродажа</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f5c1aef1-01c9-40c4-9b0e-8fc02737c36a">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1dc6ffa8-a1eb-4196-b762-491d2aadbf03">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fb38b548-c0f9-4c73-8096-dd1fb2a47a11">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="848e9bb8-228b-4917-b03a-97b6e77bf66a">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a172da5a-90d7-4e70-8215-28087753d577">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d9cc6e97-4d5b-4351-82ab-ca44976c8e37">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="bfdfc0bb-db5d-44b9-bb70-3de039de7c74">
    <name>СчетНаОплатуПокупателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9ddfa8fb-fc2f-4fbd-8790-8c24976a84fd">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fd05ae1d-34c4-4973-a9e1-34adf1748041">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="526ce2f9-38de-4278-81ce-e0f5dc7c3ead">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a9322b8-c69e-46ed-9fad-9c89913f34e9">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="28ec3cbe-73f2-46f6-b6e9-eaef4ad154a4">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7bfc286c-de8a-4570-a49e-d1c61d0761f8">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d187e835-6e14-44fd-98d0-194ddbde0217">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="18419a3a-c52e-4113-8d6c-752ef2788479">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b14d3949-6960-42fe-a6cf-09dbe3dc2212">
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6deb4108-da4a-44c6-a2c0-a06e41fa7446">
      <name>КиЗ_ГИСМ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8d24787d-954a-4f08-bc28-2135e13d34f9">
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e495d050-3085-4b0f-b777-94e96a3fc306">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="225f061b-538e-46cf-8ba2-3a062ad67198">
      <name>АкцизнаяМарка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6b391dae-09aa-4b2f-8a40-d43351c6ae2b">
    <name>АгентскиеУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6a70d926-d667-4b1f-beb0-a7928999615c">
      <name>ДоговорКонтрагента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b493c4d3-0557-498f-8926-7e187f69a2c1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="48331456-8a74-42b1-87e7-4e7b50ec597d">
      <name>Контрагент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0c8acc28-0f87-4fbf-95ef-a840831b5c20">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="39ddaf1d-0079-4e97-a5e4-37d9fa8af515">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="da9b2877-3525-49b7-bc6c-d58ec59a7d85">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f890283e-9508-4e5b-95f1-76674a5021ed">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9ce3c8af-6ca0-4fb6-93d9-ad30ab56c158">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6e3818a4-b4e8-4ed6-be3c-6524c21ec27e">
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fbadffea-8afd-48fd-8b63-b442db490c3a">
    <name>ПодарочныеСертификаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f043e068-ed52-48e0-88d7-774f1b02a58d">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a4a0a55e-03ab-4f37-8250-b44a32ff347c">
      <name>ВидОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="14a939a8-018d-463f-9daf-acb94ab1cce0">
    <name>Оплата</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4539b4b6-1471-445b-a6eb-da80fa390ac1">
      <name>ВидОплаты</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ebdd0c24-a249-4708-89c3-4f6c704d5b81">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыОперацийРозничнаяПродажа/ВидыОперацийРозничнаяПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3a74f47-391c-457c-9b21-78def2e852ec">
  <name>ВидыОперацийРозничнаяПродажа</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b2686027-b4fb-4d73-9d2e-6fae9bfa2a19">
    <name>Продажа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/РозничнаяПродажа/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура Базар_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения.Свойство("ДокументОснование") тогда
		
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
			
			Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидыОперацийРозничнаяПродажа.Продажа тогда
				Возврат;
			КонецЕсли;
			
			ВидОперации = Перечисления.ВидыОперацийРозничнаяПродажа.Продажа;
			
			Документы.РозничнаяПродажа.ЗаполнитьНаОснованииПеремещения(
				ЭтотОбъект,
				ДанныеЗаполнения.ДокументОснование
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
